app/controllers/api/v1/admin_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "adm@admin"], ["LIMIT", 1]]
---
    def login
        admin = Admin.find_by!(email: params[:email])

UPDATE "admins" SET "updated_at" = $1, "authentication_token" = $2 WHERE "admins"."id" = $3  [["updated_at", "2021-10-17 14:36:33.323141"], ["authentication_token", "QTZ36gVn97WhN568U5vK"], ["id", 1]]
---
    def logout
        current_admin.update! authentication_token: nil