app/controllers/api/v1/languages_controller.rb

    def index
        languages = Language.all
---
SELECT "languages".* FROM "languages"

    def create
        language = Language.create(language_params)
---
INSERT INTO "languages" ("name", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "F#"], ["teacher_id", 3], ["created_at", "2021-10-16 20:03:11.424076"], ["updated_at", "2021-10-16 20:03:11.424076"]]

    def update
        language = Language.find(params[:id])
---
SELECT "languages".* FROM "languages" WHERE "languages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]