app/controllers/api/v1/students_controller.rb

    def index
        students = Student.all
---
SELECT "students".* FROM "students"

    def show
        student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        student = Student.create(student_params)
---
INSERT INTO "students" ("name", "student_register", "email", "teacher_id", "created_at", "updated_at", "birthdate") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        student = Student.find(params[:id])
        student.update!(student_params)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["name", "Aninha"], ["updated_at", "2021-10-18 02:27:22.485996"], ["id", 7]]

    def delete
        student = Student.find(params[:id])
        student.destroy!
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 6]]