app/controllers/api/v1/teachers_controller.rb

    def index
        teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

    def show
        teacher = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        teacher = Teacher.create(teacher_params)
---
INSERT INTO "teachers" ("name", "email", "created_at", "updated_at", "birthdate") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Cani"], ["email", "cana@gmail.com"], ["created_at", "2021-10-17 15:34:50.429410"], ["updated_at", "2021-10-17 15:34:50.429410"], ["birthdate", "2000-12-01"]]

    def update
        teacher = Teacher.find(params[:id])
        teacher.update!(teacher_params)
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "teachers" SET "email" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["email", "cana@gmail.com"], ["updated_at", "2021-10-18 02:08:58.422772"], ["id", 5]]

    def delete
        teacher = Teacher.find(params[:id])
        teacher.destroy!
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 4]]

    def my_students
        i = params[:id]
        Teacher.find(i)
        students = Student.where teacher_id: i
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."teacher_id" = $1  [["teacher_id", 3]]